Revit 2027 API
ElementTypeDuplicatingEventArgs.ElementTypeId Property
 The id of the ElementType to be duplicated.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ElementTypeId { get; }
Public ReadOnly Property ElementTypeId As ElementId
	Get
public:
property ElementId^ ElementTypeId {
	ElementId^ get ();
}
member ElementTypeId : ElementId with get
Property Value
ElementId
See Also
Reference
ElementTypeDuplicatingEventArgs Class
Autodesk.Revit.DB.Events Namespace